onviflibs/gsoap/gsoap-2.8/gsoap/samples/link++/mashup.dtx.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://www.genivia.com/mashup.wsdl"
 xmlns:ns2="urn:daystoxmas">
 <SOAP-ENV:Body>
   <ns2:daystoxmas>   </ns2:daystoxmas>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
